na = input('Введите имя:')
su = input('Введите фамилию:')
ye = int(input('Введите год рождения:'))

age = 2024 - ye

# ИСПРАВИТЬ: вывод не соответствует требуемому формату (лишний символ конца строки, лишние пробелы)
print('\n', su, na, ',', age, end=' ')
# КОММЕНТАРИЙ: в случае, если вы будете генерировать строку не для чтения человеком, а для другой функции/класса/программы — неверный формат может стоить вам неработающего приложения


# ДОБАВИТЬ: скопированный из терминала результат выполнения программы с собственными данными


# ИТОГ: доработать — 1/2

