from utils import important_message

def main() -> None:
    message = input("текст сообщения: ")
    framed_message = important_message(message)
    
    print("\n" + framed_message + "\n")

main()


#C:\Git\Sajgakova\2024.11.30>python -i 1.py
#текст сообщения: ЗАГОЛОВОК ПРОГРАММЫ
#
#=======================================================================================================================
##                                                                                                                     #
##                                                  ЗАГОЛОВОК ПРОГРАММЫ                                                  #
##                                                                                                                     #
#=======================================================================================================================
#
#>>> text = 'Обратите внимание на очень важное сообщение от команды разработчиков этой великолепной программы'
#>>> msg = important_message(text)
#>>> print(msg)
#=======================================================================================================================
##                                                                                                                     #
##            Обратите внимание на очень важное сообщение от команды разработчиков этой великолепной программы           #
##                                                                                                                     #
#=======================================================================================================================
#>>>
